quackmore/esp8266-drivers/src/app/app_test.cpp
/*
 * ----------------------------------------------------------------------------
 * "THE BEER-WARE LICENSE" (Revision 42):
 * <quackmore-ff@yahoo.com> wrote this file.  As long as you retain this notice
 * you can do whatever you want with this stuff. If we meet some day, and you 
 * think this stuff is worth it, you can buy me a beer in return. Quackmore
 * ----------------------------------------------------------------------------
 */

// SDK includes
extern "C"
{
#include "osapi.h"
#include "mem.h"
#include "user_interface.h"
#include "ip_addr.h"
#include "drivers_di_sequence.h"
#include "drivers_do_sequence.h"
#include "esp8266_io.h"
#include "gpio.h"
}

#include "app.hpp"
#include "app_test.hpp"
#include "espbot_mem_macros.h"
#include "espbot_timedate.hpp"
#include "espbot_utils.hpp"
#include "drivers.hpp"

// function for testing purpose

extern "C" char *f2str(char *str, float value, int decimals);

static void output_seq_completed(void *param)
{
    struct do_seq *seq = (struct do_seq *)param;
    free_do_seq(seq);
    fs_printf("Test completed\n");
}

static void input_seq_completed(void *param)
{
    struct di_seq *seq = (struct di_seq *)param;
    if (seq->ended_by_timeout)
        fs_printf("Input sequence reading ended by timeout timer\n");
    else
        fs_printf("Input sequence reading completed\n");
    {
        int idx = 0;
        char level;
        uint32 duration;
        fs_printf("Sequence acquired:\n");
        for (idx = 0; idx < get_di_seq_length(seq); idx++)
        {
            level = get_di_seq_pulse_level(seq, idx);
            duration = get_di_seq_pulse_duration(seq, idx);
            if (level == ESPBOT_LOW)
                fs_printf("pulse %d: level  'LOW' - duration %d\n", idx, duration);
            else
                fs_printf("pulse %d: level 'HIGH' - duration %d\n", idx, duration);
        }
        fs_printf("Sequence end.\n");
    }
    free_di_seq(seq);
}

uint32 start_time;
uint32 end_time;
static di_seq *dht_input;

static void print_sensor(sensor_t *sensor)
{
    Heap_chunk str(20);
    fs_printf("         SENSOR\n");
    fs_printf("===>       name: %s\n", sensor->name);
    fs_printf("===>         id: %d\n", sensor->sensor_id);
    fs_printf("===>       type: %d\n", sensor->type);
    fs_printf("===>  max value: %s\n", f2str(str.ref, sensor->max_value, 2));
    fs_printf("===>  min value: %s\n", f2str(str.ref, sensor->min_value, 2));
    fs_printf("===> resolution: %s\n", f2str(str.ref, sensor->resolution, 2));
    fs_printf("===>  min delay: %d\n", sensor->min_delay);
}

static void print_event(sensors_event_t *event, int decimals)
{
    Heap_chunk str(20);
    fs_printf("          EVENT\n");
    fs_printf("==>   sensor id: %d\n", event->sensor_id);
    fs_printf("==> sensor type: %d\n", event->type);
    fs_printf("==>     invalid: %d\n", event->invalid);
    if (event->type == SENSOR_TYPE_TEMPERATURE)
        fs_printf("==> temperature: %s\n", f2str(str.ref, event->temperature, decimals));
    else
        fs_printf("==> humidity   : %s\n", f2str(str.ref, event->relative_humidity, decimals));
    fs_printf("==>   timestamp: %s\n", timedate_get_timestr(event->timestamp));
}

static void get_and_print_max6675_event(void *param)
{
    sensors_event_t event;
    max6675->getEvent(&event);
    print_event(&event, 2);
}

static void get_and_print_dht22_temperature_event(void *param)
{
    sensors_event_t event;
    dht22->temperature.getEvent(&event);
    print_event(&event, 1);
}

static void get_and_print_dht22_humidity_event(void *param)
{
    sensors_event_t event;
    dht22->humidity.getEvent(&event);
    print_event(&event, 1);
}

static void dht_reading_completed(void *param)
{
    struct di_seq *seq = (struct di_seq *)param;
    fs_printf("start DHT -> start reading = %d\n", (end_time - start_time));
    if (seq->ended_by_timeout)
        fs_printf("DHT reading ended by timeout timer\n");
    else
        fs_printf("DHT reading completed\n");
    {
        int idx = 0;
        char level;
        uint32 duration;
        fs_printf("DHT sequence acquired:\n");
        for (idx = 0; idx < get_di_seq_length(seq); idx++)
        {
            level = get_di_seq_pulse_level(seq, idx);
            duration = get_di_seq_pulse_duration(seq, idx);
            if (level == ESPBOT_LOW)
                fs_printf("pulse %d: level  'LOW' - duration %d\n", idx, duration);
            else
                fs_printf("pulse %d: level 'HIGH' - duration %d\n", idx, duration);
        }
        fs_printf("DHT sequence end.\n");
    }
    free_di_seq(seq);
}

static void IRAM dht_start_completed(void *param)
{
    struct do_seq *seq = (struct do_seq *)param;
    // start reading from DHT
    PIN_FUNC_SELECT(ESPBOT_D2_MUX, ESPBOT_D2_FUNC);
    PIN_PULLUP_EN(ESPBOT_D2_MUX);
    GPIO_DIS_OUTPUT(ESPBOT_D2_NUM);

    read_di_sequence(dht_input);

    // free output sequence
    free_do_seq(seq);
}

void run_test(int idx, int param)
{
    struct do_seq *seq;
    switch (idx)
    {
    case 1:
    {
        PIN_FUNC_SELECT(ESPBOT_D4_MUX, ESPBOT_D4_FUNC);
        GPIO_OUTPUT_SET(ESPBOT_D4_NUM, ESPBOT_HIGH);
        seq = new_do_seq(ESPBOT_D4_NUM, 1);
        set_do_seq_cb(seq, output_seq_completed, (void *)seq, task);

        out_seq_clear(seq);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        {
            int idx = 0;
            char level;
            uint32 duration;
            fs_printf("Sequence defined as:\n");
            for (idx = 0; idx < get_do_seq_length(seq); idx++)
            {
                level = get_do_seq_pulse_level(seq, idx);
                duration = get_do_seq_pulse_duration(seq, idx);
                if (level == ESPBOT_LOW)
                    fs_printf("pulse %d: level  'LOW' - duration %d\n", idx, duration);
                else
                    fs_printf("pulse %d: level 'HIGH' - duration %d\n", idx, duration);
            }
            fs_printf("Sequence end.\n");
        }
        exe_do_seq_ms(seq);
    }
    break;
    case 2:
    {
        PIN_FUNC_SELECT(ESPBOT_D4_MUX, ESPBOT_D4_FUNC);
        GPIO_OUTPUT_SET(ESPBOT_D4_NUM, ESPBOT_HIGH);
        seq = new_do_seq(ESPBOT_D4_NUM, 9);
        set_do_seq_cb(seq, output_seq_completed, (void *)seq, task);

        out_seq_clear(seq);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        out_seq_add(seq, ESPBOT_HIGH, 1500);
        out_seq_add(seq, ESPBOT_LOW, 2000);
        out_seq_add(seq, ESPBOT_HIGH, 2500);
        out_seq_add(seq, ESPBOT_LOW, 3000);
        out_seq_add(seq, ESPBOT_HIGH, 3500);
        out_seq_add(seq, ESPBOT_LOW, 4000);
        out_seq_add(seq, ESPBOT_HIGH, 4500);
        out_seq_add(seq, ESPBOT_LOW, 5000);
        {
            int idx = 0;
            char level;
            uint32 duration;
            fs_printf("Sequence defined as:\n");
            for (idx = 0; idx < get_do_seq_length(seq); idx++)
            {
                level = get_do_seq_pulse_level(seq, idx);
                duration = get_do_seq_pulse_duration(seq, idx);
                if (level == ESPBOT_LOW)
                    fs_printf("pulse %d: level  'LOW' - duration %d\n", idx, duration);
                else
                    fs_printf("pulse %d: level 'HIGH' - duration %d\n", idx, duration);
            }
            fs_printf("Sequence end.\n");
        }
        exe_do_seq_ms(seq);
    }
    break;
    case 3:
    {
        // sequence 1
        PIN_FUNC_SELECT(ESPBOT_D4_MUX, ESPBOT_D4_FUNC);
        GPIO_OUTPUT_SET(ESPBOT_D4_NUM, ESPBOT_HIGH);
        seq = new_do_seq(ESPBOT_D4_NUM, 9);
        set_do_seq_cb(seq, output_seq_completed, (void *)seq, task);

        out_seq_clear(seq);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        out_seq_add(seq, ESPBOT_HIGH, 1500);
        out_seq_add(seq, ESPBOT_LOW, 2000);
        out_seq_add(seq, ESPBOT_HIGH, 2500);
        out_seq_add(seq, ESPBOT_LOW, 3000);
        out_seq_add(seq, ESPBOT_HIGH, 3500);
        out_seq_add(seq, ESPBOT_LOW, 4000);
        out_seq_add(seq, ESPBOT_HIGH, 4500);
        out_seq_add(seq, ESPBOT_LOW, 5000);
        {
            int idx = 0;
            char level;
            uint32 duration;
            fs_printf("Sequence defined as:\n");
            for (idx = 0; idx < get_do_seq_length(seq); idx++)
            {
                level = get_do_seq_pulse_level(seq, idx);
                duration = get_do_seq_pulse_duration(seq, idx);
                if (level == ESPBOT_LOW)
                    fs_printf("pulse %d: level  'LOW' - duration %d\n", idx, duration);
                else
                    fs_printf("pulse %d: level 'HIGH' - duration %d\n", idx, duration);
            }
            fs_printf("Sequence end.\n");
        }
        // sequence 2
        struct do_seq *seq_2;
        PIN_FUNC_SELECT(ESPBOT_D5_MUX, ESPBOT_D5_FUNC);
        GPIO_OUTPUT_SET(ESPBOT_D5_NUM, ESPBOT_HIGH);
        seq_2 = new_do_seq(ESPBOT_D5_NUM, 8);
        set_do_seq_cb(seq_2, output_seq_completed, (void *)seq_2, task);

        out_seq_clear(seq_2);
        out_seq_add(seq_2, ESPBOT_LOW, 2000);
        out_seq_add(seq_2, ESPBOT_HIGH, 3000);
        out_seq_add(seq_2, ESPBOT_LOW, 2000);
        out_seq_add(seq_2, ESPBOT_HIGH, 3000);
        out_seq_add(seq_2, ESPBOT_LOW, 2000);
        out_seq_add(seq_2, ESPBOT_HIGH, 3000);
        out_seq_add(seq_2, ESPBOT_LOW, 2000);
        out_seq_add(seq_2, ESPBOT_HIGH, 3000);
        {
            int idx = 0;
            char level;
            uint32 duration;
            fs_printf("Sequence defined as:\n");
            for (idx = 0; idx < get_do_seq_length(seq_2); idx++)
            {
                level = get_do_seq_pulse_level(seq_2, idx);
                duration = get_do_seq_pulse_duration(seq_2, idx);
                if (level == ESPBOT_LOW)
                    fs_printf("pulse %d: level  'LOW' - duration %d\n", idx, duration);
                else
                    fs_printf("pulse %d: level 'HIGH' - duration %d\n", idx, duration);
            }
            fs_printf("Sequence end.\n");
        }
        exe_do_seq_ms(seq);
        exe_do_seq_ms(seq_2);
    }
    break;
    case 4:
    {
        PIN_FUNC_SELECT(ESPBOT_D4_MUX, ESPBOT_D4_FUNC);
        GPIO_OUTPUT_SET(ESPBOT_D4_NUM, ESPBOT_HIGH);
        seq = new_do_seq(ESPBOT_D4_NUM, 9);
        set_do_seq_cb(seq, output_seq_completed, (void *)seq, task);

        out_seq_clear(seq);
        out_seq_add(seq, ESPBOT_LOW, 150);
        out_seq_add(seq, ESPBOT_HIGH, 150);
        out_seq_add(seq, ESPBOT_LOW, 150);
        out_seq_add(seq, ESPBOT_HIGH, 150);
        out_seq_add(seq, ESPBOT_LOW, 150);
        out_seq_add(seq, ESPBOT_HIGH, 150);
        out_seq_add(seq, ESPBOT_LOW, 150);
        out_seq_add(seq, ESPBOT_HIGH, 150);
        out_seq_add(seq, ESPBOT_LOW, 150);
        {
            int idx = 0;
            char level;
            uint32 duration;
            fs_printf("Sequence defined as:\n");
            for (idx = 0; idx < get_do_seq_length(seq); idx++)
            {
                level = get_do_seq_pulse_level(seq, idx);
                duration = get_do_seq_pulse_duration(seq, idx);
                if (level == ESPBOT_LOW)
                    fs_printf("pulse %d: level  'LOW' - duration %d\n", idx, duration);
                else
                    fs_printf("pulse %d: level 'HIGH' - duration %d\n", idx, duration);
            }
            fs_printf("Sequence end.\n");
        }
        exe_do_seq_ms(seq);
    }
    break;
    case 5:
    {
        PIN_FUNC_SELECT(ESPBOT_D4_MUX, ESPBOT_D4_FUNC);
        GPIO_OUTPUT_SET(ESPBOT_D4_NUM, ESPBOT_HIGH);
        seq = new_do_seq(ESPBOT_D4_NUM, 9);
        set_do_seq_cb(seq, output_seq_completed, (void *)seq, task);

        out_seq_clear(seq);
        out_seq_add(seq, ESPBOT_LOW, 150000);
        out_seq_add(seq, ESPBOT_HIGH, 150000);
        out_seq_add(seq, ESPBOT_LOW, 150000);
        out_seq_add(seq, ESPBOT_HIGH, 150000);
        out_seq_add(seq, ESPBOT_LOW, 150000);
        out_seq_add(seq, ESPBOT_HIGH, 150000);
        out_seq_add(seq, ESPBOT_LOW, 150000);
        out_seq_add(seq, ESPBOT_HIGH, 150000);
        out_seq_add(seq, ESPBOT_LOW, 150000);
        {
            int idx = 0;
            char level;
            uint32 duration;
            fs_printf("Sequence defined as:\n");
            for (idx = 0; idx < get_do_seq_length(seq); idx++)
            {
                level = get_do_seq_pulse_level(seq, idx);
                duration = get_do_seq_pulse_duration(seq, idx);
                if (level == ESPBOT_LOW)
                    fs_printf("pulse %d: level  'LOW' - duration %d\n", idx, duration);
                else
                    fs_printf("pulse %d: level 'HIGH' - duration %d\n", idx, duration);
            }
            fs_printf("Sequence end.\n");
        }
        exe_do_seq_us(seq);
    }
    break;
    case 6:
    {
        // checking input sequence reading (ms)
        // defining input sequence
        PIN_FUNC_SELECT(ESPBOT_D5_MUX, ESPBOT_D5_FUNC);
        PIN_PULLUP_EN(ESPBOT_D5_MUX);
        GPIO_DIS_OUTPUT(ESPBOT_D5_NUM);

