quackmore/esp8266-drivers/src/app/app_test.cpp
        struct di_seq *input_seq = new_di_seq(ESPBOT_D5_NUM, 9, 20, TIMEOUT_MS);
        set_di_seq_cb(input_seq, input_seq_completed, (void *)input_seq, task);
        read_di_sequence(input_seq);

        // now the output
        PIN_FUNC_SELECT(ESPBOT_D4_MUX, ESPBOT_D4_FUNC);
        GPIO_OUTPUT_SET(ESPBOT_D4_NUM, ESPBOT_HIGH);
        seq = new_do_seq(ESPBOT_D4_NUM, 9);
        set_do_seq_cb(seq, output_seq_completed, (void *)seq, task);

        out_seq_clear(seq);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        out_seq_add(seq, ESPBOT_HIGH, 1000);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        out_seq_add(seq, ESPBOT_HIGH, 1000);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        out_seq_add(seq, ESPBOT_HIGH, 1000);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        out_seq_add(seq, ESPBOT_HIGH, 1000);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        {
            int idx = 0;
            char level;
            uint32 duration;
            fs_printf("Sequence defined as:\n");
            for (idx = 0; idx < get_do_seq_length(seq); idx++)
            {
                level = get_do_seq_pulse_level(seq, idx);
                duration = get_do_seq_pulse_duration(seq, idx);
                if (level == ESPBOT_LOW)
                    fs_printf("pulse %d: level  'LOW' - duration %d\n", idx, duration);
                else
                    fs_printf("pulse %d: level 'HIGH' - duration %d\n", idx, duration);
            }
            fs_printf("Sequence end.\n");
        }
        exe_do_seq_us(seq);
    }
    break;
    case 7:
    {
        // checking input sequence reading (us)
        // defining input sequence
        PIN_FUNC_SELECT(ESPBOT_D5_MUX, ESPBOT_D5_FUNC);
        PIN_PULLUP_EN(ESPBOT_D5_MUX);
        GPIO_DIS_OUTPUT(ESPBOT_D5_NUM);

        struct di_seq *input_seq = new_di_seq(ESPBOT_D5_NUM, 9, 750000, TIMEOUT_US);
        set_di_seq_cb(input_seq, input_seq_completed, (void *)input_seq, task);

        // now the output
        PIN_FUNC_SELECT(ESPBOT_D4_MUX, ESPBOT_D4_FUNC);
        GPIO_OUTPUT_SET(ESPBOT_D4_NUM, ESPBOT_HIGH);
        seq = new_do_seq(ESPBOT_D4_NUM, 9);
        set_do_seq_cb(seq, output_seq_completed, (void *)seq, task);

        out_seq_clear(seq);
        out_seq_add(seq, ESPBOT_LOW, 5);
        out_seq_add(seq, ESPBOT_HIGH, 5);
        out_seq_add(seq, ESPBOT_LOW, 5);
        out_seq_add(seq, ESPBOT_HIGH, 5);
        out_seq_add(seq, ESPBOT_LOW, 5);
        out_seq_add(seq, ESPBOT_HIGH, 5);
        out_seq_add(seq, ESPBOT_LOW, 5);
        out_seq_add(seq, ESPBOT_HIGH, 5);
        out_seq_add(seq, ESPBOT_LOW, 5);
        {
            int idx = 0;
            char level;
            uint32 duration;
            fs_printf("Sequence defined as:\n");
            for (idx = 0; idx < get_do_seq_length(seq); idx++)
            {
                level = get_do_seq_pulse_level(seq, idx);
                duration = get_do_seq_pulse_duration(seq, idx);
                if (level == ESPBOT_LOW)
                    fs_printf("pulse %d: level  'LOW' - duration %d\n", idx, duration);
                else
                    fs_printf("pulse %d: level 'HIGH' - duration %d\n", idx, duration);
            }
            fs_printf("Sequence end.\n");
        }
        read_di_sequence(input_seq);
        exe_do_seq_ms(seq);
    }
    break;
    case 8:
    {
        // checking input sequence reading end by timeout (ms)
        // defining input sequence
        PIN_FUNC_SELECT(ESPBOT_D5_MUX, ESPBOT_D5_FUNC);
        PIN_PULLUP_EN(ESPBOT_D5_MUX);
        GPIO_DIS_OUTPUT(ESPBOT_D5_NUM);

        struct di_seq *input_seq = new_di_seq(ESPBOT_D5_NUM, 9, 20, TIMEOUT_MS);
        set_di_seq_cb(input_seq, input_seq_completed, (void *)input_seq, task);
        read_di_sequence(input_seq);

        // now the output
        PIN_FUNC_SELECT(ESPBOT_D4_MUX, ESPBOT_D4_FUNC);
        GPIO_OUTPUT_SET(ESPBOT_D4_NUM, ESPBOT_HIGH);
        seq = new_do_seq(ESPBOT_D4_NUM, 7);
        set_do_seq_cb(seq, output_seq_completed, (void *)seq, task);

        out_seq_clear(seq);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        out_seq_add(seq, ESPBOT_HIGH, 1000);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        out_seq_add(seq, ESPBOT_HIGH, 1000);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        out_seq_add(seq, ESPBOT_HIGH, 1000);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        out_seq_add(seq, ESPBOT_HIGH, 1000);
        out_seq_add(seq, ESPBOT_LOW, 1000);
        {
            int idx = 0;
            char level;
            uint32 duration;
            fs_printf("Sequence defined as:\n");
            for (idx = 0; idx < get_do_seq_length(seq); idx++)
            {
                level = get_do_seq_pulse_level(seq, idx);
                duration = get_do_seq_pulse_duration(seq, idx);
                if (level == ESPBOT_LOW)
                    fs_printf("pulse %d: level  'LOW' - duration %d\n", idx, duration);
                else
                    fs_printf("pulse %d: level 'HIGH' - duration %d\n", idx, duration);
            }
            fs_printf("Sequence end.\n");
        }
        exe_do_seq_us(seq);
    }
    break;
    case 9:
    {
        // checking input sequence reading end by timeout (us)
        // defining input sequence
        PIN_FUNC_SELECT(ESPBOT_D5_MUX, ESPBOT_D5_FUNC);
        PIN_PULLUP_EN(ESPBOT_D5_MUX);
        GPIO_DIS_OUTPUT(ESPBOT_D5_NUM);

        struct di_seq *input_seq = new_di_seq(ESPBOT_D5_NUM, 9, 50000, TIMEOUT_US);
        set_di_seq_cb(input_seq, input_seq_completed, (void *)input_seq, task);

        // now the output
        PIN_FUNC_SELECT(ESPBOT_D4_MUX, ESPBOT_D4_FUNC);
        GPIO_OUTPUT_SET(ESPBOT_D4_NUM, ESPBOT_HIGH);
        seq = new_do_seq(ESPBOT_D4_NUM, 7);
        set_do_seq_cb(seq, output_seq_completed, (void *)seq, task);

        out_seq_clear(seq);
        out_seq_add(seq, ESPBOT_LOW, 5);
        out_seq_add(seq, ESPBOT_HIGH, 5);
        out_seq_add(seq, ESPBOT_LOW, 5);
        out_seq_add(seq, ESPBOT_HIGH, 5);
        out_seq_add(seq, ESPBOT_LOW, 5);
        out_seq_add(seq, ESPBOT_HIGH, 5);
        out_seq_add(seq, ESPBOT_LOW, 5);
        out_seq_add(seq, ESPBOT_HIGH, 5);
        out_seq_add(seq, ESPBOT_LOW, 5);
        {
            int idx = 0;
            char level;
            uint32 duration;
            fs_printf("Sequence defined as:\n");
            for (idx = 0; idx < get_do_seq_length(seq); idx++)
            {
                level = get_do_seq_pulse_level(seq, idx);
                duration = get_do_seq_pulse_duration(seq, idx);
                if (level == ESPBOT_LOW)
                    fs_printf("pulse %d: level  'LOW' - duration %d\n", idx, duration);
                else
                    fs_printf("pulse %d: level 'HIGH' - duration %d\n", idx, duration);
            }
            fs_printf("Sequence end.\n");
        }
        read_di_sequence(input_seq);
        exe_do_seq_ms(seq);
    }
    break;
        //    case 10:
        //    {
        //        // DHT reading
        //        // Send start sequence
        //        // High ____                    ____
        //        // Low      |_____ 1,5 ms _____|
        //        PIN_FUNC_SELECT(ESPBOT_D2_MUX, ESPBOT_D2_FUNC);
        //        GPIO_OUTPUT_SET(ESPBOT_D2_NUM, ESPBOT_HIGH);
        //        seq = new_do_seq(ESPBOT_D2_NUM, 1);
        //        set_do_seq_cb(seq, dht_start_completed, (void *)seq, task);
        //        out_seq_add(seq, ESPBOT_LOW, 1500);
        //        // out_seq_add(seq, ESPBOT_HIGH, 20);
        //        // prepare input sequence
        //        dht_input = new_di_seq(ESPBOT_D2_NUM, 82, 1000, TIMEOUT_MS);
        //        set_di_seq_cb(dht_input, dht_reading_completed, (void *)dht_input, task);
        //
        //        exe_do_seq_us(seq);
        //    }
        //    break;
        //    case 11:
        //    {
        //        // Dht class test
        //        int idx;
        //        fs_printf("DHT22 samples\n");
        //        for (idx = 0; idx < 30; idx++)
        //        {
        //            if (dht22.get_invalid(idx))
        //                fs_printf("--- %d (invalid) %d %d %s",
        //                          idx,
        //                          (int)(dht22.get_temperature(Celsius, idx) * 10),
        //                          (int)(dht22.get_humidity(idx) * 10),
        //                          timedate_get_timestr(dht22.get_timestamp(idx)));
        //            else
        //                fs_printf("--- %d           %d %d %s",
        //                          idx,
        //                          (int)(dht22.get_temperature(Celsius, idx) * 10),
        //                          (int)(dht22.get_humidity(idx) * 10),
        //                          timedate_get_timestr(dht22.get_timestamp(idx)));
        //        }
        //        fs_printf("DHT22 end\n");
        //    }
        //    break;
        //    case 12:
        //    {
        //        // Dht class test
        //        fs_printf("Latest DHT22 reading\n");
        //        if (dht22.get_invalid())
        //            fs_printf("--- (invalid) %d %d %s",
        //                      (int)(dht22.get_temperature(Celsius) * 10),
        //                      (int)(dht22.get_humidity() * 10),
        //                      timedate_get_timestr(dht22.get_timestamp()));
        //        else
        //            fs_printf("---           %d %d %s",
        //                      (int)(dht22.get_temperature(Celsius) * 10),
        //                      (int)(dht22.get_humidity() * 10),
        //                      timedate_get_timestr(dht22.get_timestamp()));
        //    }
        //    break;
        //    case 13:
        //    {
        //        // Dht class test
        //        fs_printf("Latest DHT22 reading\n");
        //        if (dht22.get_invalid())
        //            fs_printf("--- (invalid) %d %d %s",
        //                      (int)(dht22.get_temperature(Fahrenheit) * 10),
        //                      (int)(dht22.get_humidity() * 10),
        //                      timedate_get_timestr(dht22.get_timestamp()));
        //        else
        //            fs_printf("---           %d %d %s",
        //                      (int)(dht22.get_temperature(Fahrenheit) * 10),
        //                      (int)(dht22.get_humidity() * 10),
        //                      timedate_get_timestr(dht22.get_timestamp()));
        //    }
        //    break;
        //    case 14:
        //    {
        //        // Max6675 class test
        //        int idx;
        //        fs_printf("Max6675 samples\n");
        //        for (idx = 0; idx < 30; idx++)
        //        {
        //            if (max6675.get_invalid(idx))
        //                fs_printf("--- %d (invalid) %d %s",
        //                          idx,
        //                          (int)(max6675.get_temperature(Celsius, idx) * 100),
        //                          timedate_get_timestr(max6675.get_timestamp(idx)));
        //            else
        //                fs_printf("--- %d           %d %s",
        //                          idx,
        //                          (int)(max6675.get_temperature(Celsius, idx) * 100),
        //                          timedate_get_timestr(max6675.get_timestamp(idx)));
        //        }
        //        fs_printf("Max6675 end\n");
        //    }
        //    break;
        //    case 15:
        //    {
        //        // Dht class test
        //        fs_printf("Latest Max6675 reading\n");
        //        if (max6675.get_invalid())
        //            fs_printf("--- %d (invalid) %d %s",
        //                      idx,
        //                      (int)(max6675.get_temperature(Celsius, idx) * 100),
        //                      timedate_get_timestr(max6675.get_timestamp(idx)));
        //        else
        //            fs_printf("---           %d %s",
        //                      (int)(max6675.get_temperature(Celsius) * 100),
        //                      timedate_get_timestr(max6675.get_timestamp()));
        //    }
        //    break;
        //    case 16:
        //    {
        //        // Dht class test
        //        fs_printf("Latest Max6675 reading\n");
        //        if (max6675.get_invalid())
        //            fs_printf("--- %d (invalid) %d %s",
        //                      idx,
        //                      (int)(max6675.get_temperature(Celsius, idx) * 100),
        //                      timedate_get_timestr(max6675.get_timestamp(idx)));
        //        else
        //            fs_printf("---           %d %s",
        //                      (int)(max6675.get_temperature(Fahrenheit) * 100),
        //                      timedate_get_timestr(max6675.get_timestamp()));
        //    }
        //    break;
    case 17:
    {
        // MAX6675 single reading and force reading
        sensor_t sensor;
        max6675->getSensor(&sensor);
        print_sensor(&sensor);
        sensors_event_t event;
        max6675->getEvent(&event);
        print_event(&event, 2);

        max6675->force_reading(get_and_print_max6675_event, NULL);
    }
    break;
    case 18:
    {
        // MAX6675 all events reading
        sensor_t sensor;
        max6675->getSensor(&sensor);
        print_sensor(&sensor);
        int idx;
        sensors_event_t event;
        for (idx = 0; idx < max6675->get_max_events_count(); idx++)
        {
            max6675->getEvent(&event, idx);
            print_event(&event, 2);
        }
    }
    break;
    case 19:
    {
        // DHT temperature single reading and force reading
        sensor_t sensor;
        dht22->temperature.getSensor(&sensor);
        print_sensor(&sensor);
        sensors_event_t event;
        dht22->temperature.getEvent(&event);
        print_event(&event, 1);

        dht22->temperature.force_reading(get_and_print_dht22_temperature_event, NULL);
    }
    break;
    case 20:
    {
        // DHT temperature all events reading
        sensor_t sensor;
        dht22->temperature.getSensor(&sensor);
        print_sensor(&sensor);
        int idx;
        sensors_event_t event;
        for (idx = 0; idx < dht22->temperature.get_max_events_count(); idx++)
        {
            dht22->temperature.getEvent(&event, idx);
            print_event(&event, 1);
        }
    }
    break;
    case 21:
    {
        // DHT humidity single reading and force reading
        sensor_t sensor;
        dht22->humidity.getSensor(&sensor);
        print_sensor(&sensor);
        sensors_event_t event;
        dht22->humidity.getEvent(&event);
        print_event(&event, 1);

        dht22->humidity.force_reading(get_and_print_dht22_humidity_event, NULL);
    }
    break;
    case 22:
    {
        // DHT humidity all events reading
        sensor_t sensor;
        dht22->humidity.getSensor(&sensor);
        print_sensor(&sensor);
        int idx;
        sensors_event_t event;
        for (idx = 0; idx < dht22->humidity.get_max_events_count(); idx++)
        {
            dht22->humidity.getEvent(&event, idx);
            print_event(&event, 1);
        }
    }
    break;
    default:
        break;
    }
}